/*
    Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. 
    Сформируйте строку, в которой все заглавные буквы заменены на строчные.
*/
string input = "aAFcDFoPErN";
System.Console.WriteLine(input);

string result = input.ToLower();
System.Console.WriteLine(result);